<?php
 $sa_cities = [
       [
       'citiy' => 'تبوك', 
       'state' => 'الحدود-الشمالية',
    ],
   [
       'citiy' => 'الرياض', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'الطائف', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'مكة المكرمة', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'حائل', 
        'state' => 'حائل',
    ],
   [
       'citiy' => 'بريدة',
        'state' => 'القصيم',
    ], 
   [
       'citiy' => 'الهفوف', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'الدمام', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'المدينة المنورة', 
        'state' => 'المدينة-المنورة',
    ],
   [
       'citiy' => 'ابها', 
        'state' => 'عسير',
    ],
   [
       'citiy' => 'جدة', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'المجمعة', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'الخبر', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'حفر الباطن',
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'خميس مشيط', 
        'state' => 'عسير',
    ],
   [
       'citiy' => 'احد رفيده', 
        'state' => 'عسير',
    ],
   [
       'citiy' => 'القطيف', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'عنيزة', 
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'قرية العليا', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'الجبيل', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'النعيرية',
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'الظهران', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'الوجه', 
        'state' => 'تبوك',
    ],
   [
       'citiy' => 'بقيق', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'الزلفي', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'خيبر', 
        'state' => 'المدينة-المنورة',
    ],
   [
       'citiy' => 'الغاط', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'املج', 
        'state' => 'تبوك',
    ],
   [
       'citiy' => 'رابغ', 
        'state' => 'مكة-المكرمة	',
    ],
   [
       'citiy' => 'عفيف', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'ثادق', 
        'state' => 'الحدود-الشمالية',
    ],
   [
       'citiy' => 'سيهات', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'ينبع', 
        'state' => 'المدينة-المنورة	',
    ],
   [
       'citiy' => 'شقراء', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'الدوادمي', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'الدرعية', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'القويعية', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'المزاحمية',
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'بدر', 
        'state' => 'المدينة-المنورة',
    ],
   [
       'citiy' => 'الخرج', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'الدلم', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'الشنان', 
        'state' => 'حائل',
    ],
   [
       'citiy' => 'الخرمة', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'الجموم', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'المجاردة', 
        'state' => 'عسير',
    ],
   [
       'citiy' => 'السليل', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'تثليث', 
        'state' => 'عسير',
    ],
   [
       'citiy' => 'بيشة', 
        'state' => 'عسير ',
    ],
   [
       'citiy' => 'الباحة', 
        'state' => 'الباحة',
    ],
   [
       'citiy' => 'القنفذة', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'محايل', 
        'state' => 'عسير',
    ],
   [
       'citiy' => 'ثول',
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'ضبا', 
        'state' => 'تبوك',
    ],
   [
       'citiy' => 'تربه', 
        'state' => 'مكة-المكرمة',
    ],
   [
       'citiy' => 'صفوى', 
        'state' => 'القطيف',
    ],
   [
       'citiy' => 'عنك', 
        'state' => 'القطيف',
    ],
   [
       'citiy' => 'طريف', 
        'state' => 'الحدود-الشمالية',
    ],
   [
       'citiy' => 'عرعر', 
        'state' => 'الحدود-الشمالية',
    ],
   [
       'citiy' => 'القريات', 
        'state' => 'الجوف',
    ],
   [
       'citiy' => 'سكاكا', 
        'state' => 'الجوف',
    ],
   [
       'citiy' => 'رفحاء',
        'state' => 'الحدود-الشمالية',
    ],
   [
       'citiy' => 'دومة الجندل', 
        'state' => 'الجوف ',
    ],
   [
       'citiy' => 'الرس', 
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'المذنب', 
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'الخفجي', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'رياض الخبراء',
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'البدائع', 
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'رأس تنورة', 
        'state' => 'الشرقية',
    ],
   [
       'citiy' => 'البكيرية', 
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'الشماسية', 
        'state' => 'القصيم',
    ],
   [
       'citiy' => 'الحريق', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'حوطة بني تميم', 
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'ليلى',
        'state' => 'الرياض',
    ],
   [
       'citiy' => 'بللسمر',
        'state' => 'عسير',
    ],
   [
       'citiy' => 'شرورة',
        'state' => 'نجران ',
    ],
   [
       'citiy' => 'نجران',
        'state' => 'نجران ',
    ],
   [
       'citiy' => 'صبيا',
        'state' => 'جازان',
    ],
   [
       'citiy' => 'ابو عريش',
        'state' => 'جازان',
    ],
   [
       'citiy' => 'صامطة',
       'state' => 'جازان',
    ],
   [
       'citiy' => 'احد المسارحة',
        'state' => 'جازان',
    ],
   [
       'citiy' => 'مدينة الملك عبدالله الاقتصادية',
       'state' => 'مكة-المكرمة',
   ],
];


foreach ($sa_cities as $citiy) {
    
    $inserted_term = wp_insert_term($citiy['citiy'],'property_city');
    if( is_wp_error($inserted_term) ) {
        $new_term_id = $inserted_term->error_data['term_exists'];
    } else {
        $new_term_id = $inserted_term['term_id'];
    }
    // var_dump($new_term_id);wp_die(); 
    $houzez_meta['parent_state'] = $citiy['state'];

    update_option( '_houzez_property_city_'.$new_term_id, $houzez_meta );
}